#### Terraform Plan 📖

```
[command]/home/runner/work/_temp/c640c0b4-f801-4cf3-a504-814e9c4c3186/terraform-bin -chdir=deploy/infra show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # digitalocean_droplet.app will be created
  + resource "digitalocean_droplet" "app" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-22-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "asset-archive-dev-app"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "nyc3"
      + resize_disk          = true
      + size                 = "s-2vcpu-4gb"
      + ssh_keys             = [
          + "50873586",
        ]
      + status               = (known after apply)
      + tags                 = [
          + "environment:dev",
          + "project:asset-archive",
          + "role:app",
          + "terraform:true",
          + "test-tag:workflow-test",
        ]
      + urn                  = (known after apply)
      + user_data            = (sensitive)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = "513b6b9a-4108-407a-8d40-23ad823847be"
    }

  # digitalocean_project_resources.main will be updated in-place
  ~ resource "digitalocean_project_resources" "main" {
        id        = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"
      ~ resources = [] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # null_resource.container_update will be created
  + resource "null_resource" "container_update" {
      + id       = (known after apply)
      + triggers = {
          + "cms_image"      = "ghcr.io/davidb-onchain/asset-archive-cms:develop-137d3d6"
          + "droplet_id"     = (known after apply)
          + "frontend_image" = "ghcr.io/davidb-onchain/asset-archive-frontend:develop-137d3d6"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cms_admin_url                = "http://167.172.250.79:1337/admin" -> (known after apply)
  ~ cms_url                      = "http://167.172.250.79:1337" -> (known after apply)
  ~ droplet_id                   = "520048519" -> (known after apply)
  ~ droplet_ipv4_address         = "167.172.250.79" -> (known after apply)
  ~ droplet_ipv4_address_private = "10.10.0.2" -> (known after apply)
  ~ frontend_url                 = "http://167.172.250.79:3000" -> (known after apply)
  ~ ssh_connection               = "ssh root@167.172.250.79" -> (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # digitalocean_droplet.app will be created%0A  + resource "digitalocean_droplet" "app" {%0A      + backups              = false%0A      + created_at           = (known after apply)%0A      + disk                 = (known after apply)%0A      + graceful_shutdown    = false%0A      + id                   = (known after apply)%0A      + image                = "ubuntu-22-04-x64"%0A      + ipv4_address         = (known after apply)%0A      + ipv4_address_private = (known after apply)%0A      + ipv6                 = false%0A      + ipv6_address         = (known after apply)%0A      + locked               = (known after apply)%0A      + memory               = (known after apply)%0A      + monitoring           = false%0A      + name                 = "asset-archive-dev-app"%0A      + price_hourly         = (known after apply)%0A      + price_monthly        = (known after apply)%0A      + private_networking   = (known after apply)%0A      + region               = "nyc3"%0A      + resize_disk          = true%0A      + size                 = "s-2vcpu-4gb"%0A      + ssh_keys             = [%0A          + "50873586",%0A        ]%0A      + status               = (known after apply)%0A      + tags                 = [%0A          + "environment:dev",%0A          + "project:asset-archive",%0A          + "role:app",%0A          + "terraform:true",%0A          + "test-tag:workflow-test",%0A        ]%0A      + urn                  = (known after apply)%0A      + user_data            = (sensitive)%0A      + vcpus                = (known after apply)%0A      + volume_ids           = (known after apply)%0A      + vpc_uuid             = "513b6b9a-4108-407a-8d40-23ad823847be"%0A    }%0A%0A  # digitalocean_project_resources.main will be updated in-place%0A  ~ resource "digitalocean_project_resources" "main" {%0A        id        = "d2c0a376-79b7-4091-a1fa-0c82bca6a82a"%0A      ~ resources = [] -> (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # null_resource.container_update will be created%0A  + resource "null_resource" "container_update" {%0A      + id       = (known after apply)%0A      + triggers = {%0A          + "cms_image"      = "ghcr.io/davidb-onchain/asset-archive-cms:develop-137d3d6"%0A          + "droplet_id"     = (known after apply)%0A          + "frontend_image" = "ghcr.io/davidb-onchain/asset-archive-frontend:develop-137d3d6"%0A        }%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ cms_admin_url                = "http://167.172.250.79:1337/admin" -> (known after apply)%0A  ~ cms_url                      = "http://167.172.250.79:1337" -> (known after apply)%0A  ~ droplet_id                   = "520048519" -> (known after apply)%0A  ~ droplet_ipv4_address         = "167.172.250.79" -> (known after apply)%0A  ~ droplet_ipv4_address_private = "10.10.0.2" -> (known after apply)%0A  ~ frontend_url                 = "http://167.172.250.79:3000" -> (known after apply)%0A  ~ ssh_connection               = "ssh root@167.172.250.79" -> (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

```
*Pushed by: @davidb-onchain, Action: `pull_request`*